# basics
brew "jq"
brew "wget"

# pwsh
cask "powershell"
tap "jandedobbeleer/oh-my-posh"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "font-meslo-lg-nerd-font"

# git
brew "git"
brew "gh"

# gpg
brew "gnupg"
brew "pinentry-mac"

# browser
cask "firefox"
cask "google-chrome"

# password manager
cask "bitwarden"
brew "bitwarden-cli"

# authenticator
cask "ente-auth"
brew "ente-cli"