# basics
brew "jq"
brew "wget"

# git
brew "git"
brew "gh"

# gpg
brew "gnupg"
brew "pinentry-mac"

# pwsh
cask "powershell"
tap "jandedobbeleer/oh-my-posh"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "font-meslo-lg-nerd-font"

# azure
tap "azure/bicep"
brew "azure/bicep/bicep"
tap "azure/kubelogin"
brew "azure/kubelogin/kubelogin"
brew "azure-cli"

# terraform
# brew tfenv

# opentofu
tap "tofuutils/tap"
brew "tofuenv"
# tofuenv list-remote
# tofuenv install 1.11.5
# tofuenv use 1.11.5
# tofu -version

# vscode
cask "visual-studio-code"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-vscode.powershell"
vscode "usernamehw.errorlens"

# browser
cask "firefox"
cask "google-chrome"

# password manager
cask "bitwarden"
brew "bitwarden-cli"

# authenticator
cask "ente-auth"
brew "ente-cli"

# collaboration
cask "slack"
cask "microsoft-teams"

# battery charge limiter
cask "aldente"

# video player
cask "vlc"

# remote desktop client
cask "windows-app"

# windows style alt tab
cask "alt-tab"