# basics
brew "jq" # json processor
brew "yq" # yaml processor
brew "bat" # cat clone
brew "wget"
brew "watch"
brew "mise"
brew "sops"

# source control and ci
brew "git"
brew "gh"
brew "act"

# gpg
brew "gnupg"
brew "pinentry-mac"

# terminal
brew "starship"

# pwsh
cask "powershell"
tap "jandedobbeleer/oh-my-posh"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "font-meslo-lg-nerd-font"

# azure
brew "azure-cli"
tap "azure/bicep"
brew "azure/bicep/bicep"

# containers locally
brew "podman"
cask "podman-desktop"
tap "slp/krunkit"
brew "krunkit"
brew "kind"
brew "cloud-provider-kind"

# container tools
tap "azure/kubelogin"
brew "azure/kubelogin/kubelogin"
brew "skopeo"
brew "kubectx"
tap "fluxcd/tap"
brew "flux"
brew "controlplaneio-fluxcd/tap/flux-operator"

# vscode
cask "visual-studio-code"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-vscode.powershell"
vscode "usernamehw.errorlens"
vscode "tamasfe.even-better-toml"
vscode "redhat.vscode-yaml"

# browser
cask "firefox"
cask "google-chrome"

# password manager
cask "bitwarden"
brew "bitwarden-cli"

# authenticator
cask "ente-auth"
brew "ente-cli"

# collaboration
cask "slack"
cask "microsoft-teams"

# battery charge limiter
cask "aldente"

# video player
cask "vlc"

# remote desktop client
cask "windows-app"

# windows style alt tab
cask "alt-tab"

# office
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"

# capture the flag
cask "burp-suite"